USE [Kadr]
GO

INSERT INTO [ShemaTabel].[Exception]
           ([ExceptionName], [DateException], [idDayStatus], [idPrikaz], [KolHourMPS], [KolHourMNS], [KolHourGPS], [KolHourGNS], [idWorkShedule])
     VALUES 
	 --====================================================================================================================================
            --новый год + рождество [idWorkShedule]=1
			('Новый год', '2018-01-01'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-02'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-03'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-04'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-05'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-06'              , 17,        1,           0,              0,           0,            0,           1),
            ('Рождество', '2018-01-07'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2018-01-08'              , 17,        1,           0,              0,           0,            0,           1),
            -- [idWorkShedule] =2 
            ('Новый год', '2018-01-01'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-02'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-03'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-04'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-05'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-06'              , 17,        1,           0,              0,           0,            0,           2),
            ('Рождество', '2018-01-07'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2018-01-08'              , 17,        1,           0,              0,           0,            0,           2),
            -- ДЗО
            ('День защитника Отечества', '2018-02-23',17,        1,           0,              0,           0,            0,           1),
            ('День защитника Отечества', '2018-02-23',17,        1,           0,              0,           0,            0,           2),
            --МЖД
            ('Международный женский день', '2018-03-08',17,        1,           0,              0,           0,            0,           1),
            ('Международный женский день', '2018-03-08',17,        1,           0,              0,           0,            0,           2),
            --ПразникВиТ
            ('Праздник Весны и Труда', '2018-05-01'    ,17,        1,           0,              0,           0,            0,           1),
            ('Праздник Весны и Труда', '2018-05-01'   ,17,        1,           0,              0,           0,            0,           2),
            --ДПобеды
            ('День Победы', '2018-05-09'               ,17,        1,           0,              0,           0,            0,           1),
            ('День Победы', '2018-05-09'               ,17,        1,           0,              0,           0,            0,           2),
            --ДРоссиии
            ('День России', '2018-06-12'               ,17,        1,           0,              0,           0,            0,           1),
            ('День России', '2018-06-12'               ,17,        1,           0,              0,           0,            0,           2),
            --ДНародногоЕ
            ('День Народного единства', '2018-11-04'   ,17,        1,           0,              0,           0,            0,           1),
            ('День Народного единства', '2018-11-04'   ,17,        1,           0,              0,           0,            0,           2),
			--================================================================================================================================
           
		    --Переносы
            ('Перенос с 6 января(сб)',   '2018-03-09'    ,27,        1,           0,              0,           0,            0,           1),
            ('Перенос с 7 января(вс)',   '2018-05-02'    ,27,        1,           0,              0,           0,            0,           1),
            ('Перенос с 7 января(вс)',   '2018-05-02'    ,27,        1,           0,              0,           0,            0,           2),
            ('Перенос с 28 апреля(сб)',  '2018-04-30'    ,27,        1,           0,              0,           0,            0,           1),
            ('Перенос с 9 июня(сб)',     '2018-11-05'    ,27,        1,           0,              0,           0,            0,           1),
            ('Перенос с 29 декабря(сб)', '2018-12-31'    ,27,        1,           0,              0,           0,            0,           1),

            --Предпраздничные дни
            ('ППД к Дню защитника Отечества', '2018-02-22',22,        1,           0,              0,           0,            0,           1),
            ('ППД к Дню защитника Отечества', '2018-02-22',22,        1,           0,              0,           0,            0,           2),
            ('ППД к МЖД', '2018-03-07'                    ,22,        1,           0,              0,           0,            0,           1),
            ('ППД к МЖД', '2018-03-07'                    ,22,        1,           0,              0,           0,            0,           2),
			('ППД к Дню Весны и труда',       '2018-04-28',22,        1,           0,              0,           0,            0,           1),
            ('ППД к Дню Весны и труда',       '2018-04-28',22,        1,           0,              0,           0,            0,           2),
            ('ППД к Дню Победы', '2018-05-08'             ,22,        1,           0,              0,           0,            0,           1),
			('ППД к Дню Победы', '2018-05-08'             ,22,        1,           0,              0,           0,            0,           2),
			('ППД к Дню России', '2018-06-09'             ,22,        1,           0,              0,           0,            0,           1),
			('ППД к Дню России', '2018-06-09'             ,22,        1,           0,              0,           0,            0,           2),
			('ППД к Новому Году', '2018-12-29'             ,22,        1,           0,              0,           0,            0,          1),
			('ППД к Новому Году', '2018-12-29'             ,22,        1,           0,              0,           0,            0,          2)
          -- (<ExceptionName, varchar(50),>,<DateException, date,>,<idDayStatus, int,> ,<idPrikaz, int,>,<KolHourMPS, real,>,<KolHourMNS, real,>,<KolHourGPS, real,>,<KolHourGNS, real,>,<idWorkShedule, int,>) 
          --idWorkShedule=1->5 
          --idWorkShedule=2->6 
          --idWorkShedule=3 ->~
          --idDayStatus=17 ->выходной(7) и праздничный
          --idDayStatus=22 ->Пред праздничный день
GO