USE [Kadr]
GO

INSERT INTO [ShemaTabel].[Exception]
           ([ExceptionName], [DateException], [idDayStatus], [idPrikaz], [KolHourMPS], [KolHourMNS], [KolHourGPS], [KolHourGNS], [idWorkShedule])
     VALUES --новый год + рождество [idWorkShedule]=1
            ('Новый год', '2017-01-01'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-02'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-03'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-04'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-05'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-06'              , 17,        1,           0,              0,           0,            0,           1),
            ('Рождество', '2017-01-07'              , 17,        1,           0,              0,           0,            0,           1),
            ('Новый год', '2017-01-08'              , 17,        1,           0,              0,           0,            0,           1),
            -- [idWorkShedule] =2 
            ('Новый год', '2017-01-01'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-02'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-03'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-04'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-05'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-06'              , 17,        1,           0,              0,           0,            0,           2),
            ('Рождество', '2017-01-07'              , 17,        1,           0,              0,           0,            0,           2),
            ('Новый год', '2017-01-08'              , 17,        1,           0,              0,           0,            0,           2),
            -- ДЗО
            ('День защитника Отечества', '2017-02-23',17,        1,           0,              0,           0,            0,           1),
            ('День защитника Отечества', '2017-02-23',17,        1,           0,              0,           0,            0,           2),
            --МЖД
            ('Международный женский день', '2017-03-08',17,        1,           0,              0,           0,            0,           1),
            ('Международный женский день', '2017-03-08',17,        1,           0,              0,           0,            0,           2),
            --ПразникВиТ
            ('Праздник Весны и Труда', '2017-05-01'    ,17,        1,           0,              0,           0,            0,           1),
            ('Праздник Весны и Труда;', '2017-05-01'   ,17,        1,           0,              0,           0,            0,           2),
            --ДПобеды
            ('День Победы', '2017-05-09'               ,17,        1,           0,              0,           0,            0,           1),
            ('День Победы', '2017-05-09'               ,17,        1,           0,              0,           0,            0,           2),
            --ДРоссиии
            ('День России', '2017-06-12'               ,17,        1,           0,              0,           0,            0,           1),
            ('День России', '2017-06-12'               ,17,        1,           0,              0,           0,            0,           2),
            --ДНародногоЕ
            ('День Народного единства', '2017-11-04'   ,17,        1,           0,              0,           0,            0,           1),
            ('День Народного единства', '2017-11-04'   ,17,        1,           0,              0,           0,            0,           2),
            --Переносы
            ('Перенос с 1 января(вс)', '2017-02-24'    ,17,        1,           0,              0,           0,            0,           1),
            ('Перенос с 1 января(вс)', '2017-02-24'    ,17,        1,           0,              0,           0,            0,           2),
            ('Перенос с 7 января(сб)', '2017-05-08'    ,17,        1,           0,              0,           0,            0,           1),
          --('Перенос с 7 января(сб)', '2017-05-08'    ,17,        1,           0,              0,           0,            0,           2), надо ли?
            ('Перенос ДНЕ с 4 ноября(сб)', '2017-11-06',17,        1,           0,              0,           0,            0,           1),
          --('Перенос с 4 ноября(сб)', '2017-11-06'    ,17,        1,           0,              0,           0,            0,           2), надо ли?
            --Предпраздничные дни
            ('ППД к Дню защитника Отечества', '2017-02-22',22,        1,           0,              0,           0,            0,           1),
            ('ППД к Дню защитника Отечества', '2017-02-22',22,        1,           0,              0,           0,            0,           2),
            ('ППД к МЖД', '2017-03-07'                    ,22,        1,           0,              0,           0,            0,           1),
            ('ППД к МЖД', '2017-03-07'                    ,22,        1,           0,              0,           0,            0,           2),
            ('ППД к Дню Победы', '2017-05-08'             ,22,        1,           0,              0,           0,            0,           2), --??
            ('ППД к Дню Народного единства', '2017-11-03' ,22,        1,           0,              0,           0,            0,           1),
            ('ППД к Дню Народного единства', '2017-11-03' ,22,        1,           0,              0,           0,            0,           2)
          -- (<ExceptionName, varchar(50),>,<DateException, date,>,<idDayStatus, int,> ,<idPrikaz, int,>,<KolHourMPS, real,>,<KolHourMNS, real,>,<KolHourGPS, real,>,<KolHourGNS, real,>,<idWorkShedule, int,>) 
          --idWorkShedule=1->5 
          --idWorkShedule=2->6 
          --idWorkShedule=3 ->~
          --idDayStatus=17 ->выходной(7) и праздничный
          --idDayStatus=22 ->Пред праздничный день
GO